### Wrangle Data

In [2]:
df = wrangle_zillow.wrangle_zillow()

df.head()

,bedrooms,bathrooms,square_feet,taxes,home_value,propertylandusedesc,fips_number
0,4.0,2.0,1604,6089.82,498347.0,Single Family Residential,6037
1,3.0,3.0,2384,6679.55,549917.0,Single Family Residential,6037
2,3.0,2.0,1574,3876.31,235272.0,Single Family Residential,6037
3,2.0,2.0,1619,4206.15,340000.0,Single Family Residential,6037
4,2.0,3.0,2408,24353.42,2017254.0,Single Family Residential,6037

In [3]:
#df.rename(columns={"bedroomcnt": "bedrooms", "bathroomcnt": "bathrooms", "calculatedfinishedsquarefeet": "square_feet", "taxamount": "taxes", "taxvaluedollarcnt": "home_value"})

In [4]:
util.tell_me_about(df)

DataFrame Shape:

(15956, 7)

Info about:

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15956 entries, 0 to 15955
Data columns (total 7 columns):
bedrooms               15956 non-null float64
bathrooms              15956 non-null float64
square_feet            15956 non-null int64
taxes                  15956 non-null float64
home_value             15956 non-null float64
propertylandusedesc    15956 non-null category
fips_number            15956 non-null int64
dtypes: category(1), float64(4), int64(2)
memory usage: 888.3 KB
None

Describe:

           bedrooms     bathrooms   square_feet          taxes    home_value  \
count  15956.000000  15956.000000  15956.000000   15956.000000  1.595600e+04
mean       3.253384      2.215844   1837.197794    5681.839846  4.634078e+05
std        0.949643      1.026662    984.838795    7466.645847  6.434229e+05
min        1.000000      1.000000    320.000000      49.180000  1.216800e+04
25%        3.000000      2.000000   1233.000000    2496.027500  1.820338e+05
50%        3.000000      2.000000   1592.000000    4065.150000  3.205150e+05
75%        4.000000      3.000000   2164.000000    6409.490000  5.286050e+05
max       25.000000     20.000000  26345.000000  228999.210000  1.912982e+07

        fips_number
count  15956.000000
mean    6044.487591
std       17.283469
min     6037.000000
25%     6037.000000
50%     6037.000000
75%     6037.000000
max     6111.000000

Preview:

   bedrooms  bathrooms  square_feet     taxes  home_value  \
0       4.0        2.0         1604   6089.82    498347.0
1       3.0        3.0         2384   6679.55    549917.0
2       3.0        2.0         1574   3876.31    235272.0
3       2.0        2.0         1619   4206.15    340000.0
4       2.0        3.0         2408  24353.42   2017254.0

         propertylandusedesc  fips_number
0  Single Family Residential         6037
1  Single Family Residential         6037
2  Single Family Residential         6037
3  Single Family Residential         6037
4  Single Family Residential         6037

### Split Data

In [5]:
df.head(10)

,bedrooms,bathrooms,square_feet,taxes,home_value,propertylandusedesc,fips_number
0,4.0,2.0,1604,6089.82,498347.0,Single Family Residential,6037
1,3.0,3.0,2384,6679.55,549917.0,Single Family Residential,6037
2,3.0,2.0,1574,3876.31,235272.0,Single Family Residential,6037
3,2.0,2.0,1619,4206.15,340000.0,Single Family Residential,6037
4,2.0,3.0,2408,24353.42,2017254.0,Single Family Residential,6037
5,4.0,2.0,1721,6861.51,629951.0,Single Family Residential,6037
6,3.0,1.0,1136,5488.23,305481.0,Single Family Residential,6037
7,2.0,1.0,1088,1498.86,79930.0,Single Family Residential,6037
8,2.0,1.0,914,3473.87,260000.0,Single Family Residential,6037
9,3.0,2.0,1263,1048.54,66220.0,Single Family Residential,6037

In [6]:
train, test = split_scale_zillow.split_my_data(df)

In [7]:
x_train = train[["bedrooms", "bathrooms", "square_feet"]]
y_train = train[["home_value"]]
x_test = test[["bedrooms", "bathrooms", "square_feet"]]
y_test = test[["home_value"]]

In [8]:
predictions=pd.DataFrame({'actual':y_train.home_value}).reset_index(drop=True)
predictions.head()

      actual
0   475946.0
1   250799.0
2   199479.0
3  1252995.0
4   107124.0

In [9]:
#model 1
lm1=LinearRegression()
lm1.fit(x_train,y_train)
lm1_predictions=lm1.predict(x_train)
predictions['lm1']=lm1_predictions

In [10]:
#model 2
lm2=LinearRegression()
lm2.fit(x_train[["square_feet"]],y_train)
lm2_predictions=lm2.predict(x_train[["square_feet"]])
predictions['lm2']=lm2_predictions

In [11]:
#baseline model
predictions['baseline'] = y_train.mean()[0]
predictions.head()

      actual            lm1            lm2       baseline
0   475946.0  637253.348706  600593.798130  466158.614463
1   250799.0  248217.511284  243878.371844  466158.614463
2   199479.0  205250.600682  122011.179945  466158.614463
3  1252995.0  889736.594052  914571.077257  466158.614463
4   107124.0  458628.413111  411022.610732  466158.614463

In [12]:
MSE_baseline = mean_squared_error(predictions.actual, predictions.baseline)
SSE_baseline = MSE_baseline*len(predictions.actual)
RMSE_baseline = sqrt(MSE_baseline)
r2_baseline = r2_score(predictions.actual, predictions.baseline)
print(MSE_baseline,SSE_baseline,RMSE_baseline,r2_baseline)

434952376131.3264 5551732128940250.0 659509.1933637669 0.0

In [13]:
MSE_1 = mean_squared_error(predictions.actual, predictions.lm1)
SSE_1 = MSE_1*len(predictions.actual)
RMSE_1 = sqrt(MSE_1)
r2_1 = r2_score(predictions.actual, predictions.lm1)
print(MSE_1,SSE_1,RMSE_1,r2_1)

248861731613.72168 3176471142317543.5 498860.433000776 0.42784142524472113

In [14]:
MSE_2 = mean_squared_error(predictions.actual, predictions.lm2)
SSE_2 = MSE_2*len(predictions.actual)
RMSE_2 = sqrt(MSE_2)
r2_2 = r2_score(predictions.actual, predictions.lm2)
print(MSE_2,SSE_2,RMSE_2,r2_2)

259680008185.3707 3314555624478071.5 509588.0769654748 0.40296910090459015

In [15]:
model_train, model_test = model_zillow.modeling_function(x_train, x_test, y_train, y_test)
model_train.head()

      actual            lm1
0   475946.0  637253.348706
1   250799.0  248217.511284
2   199479.0  205250.600682
3  1252995.0  889736.594052
4   107124.0  458628.413111

In [16]:
util.tell_me_about(model_train)

DataFrame Shape:

(12764, 2)

Info about:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12764 entries, 0 to 12763
Data columns (total 2 columns):
actual    12764 non-null float64
lm1       12764 non-null float64
dtypes: float64(2)
memory usage: 199.5 KB
None

Describe:

             actual           lm1
count  1.276400e+04  1.276400e+04
mean   4.661586e+05  4.661586e+05
std    6.595350e+05  4.313991e+05
min    1.216800e+04 -2.677119e+05
25%    1.824972e+05  2.075943e+05
50%    3.186745e+05  3.567202e+05
75%    5.295208e+05  5.931809e+05
max    1.912982e+07  1.176121e+07

Preview:

      actual            lm1
0   475946.0  637253.348706
1   250799.0  248217.511284
2   199479.0  205250.600682
3  1252995.0  889736.594052
4   107124.0  458628.413111

In [17]:
scaler, x_train_scaled, x_test_scaled = split_scale_zillow.standard_scaler(x_train, x_test)
print(x_train_scaled.head())
print(x_test_scaled.head())

       bedrooms  bathrooms  square_feet
3305  -0.262689  -0.211923     0.321112
10916 -0.262689  -0.211923    -0.530938
10273 -1.307227  -1.182145    -0.822030
1659   0.781849   0.758300     1.071078
14226 -0.262689   0.273189    -0.131698
       bedrooms  bathrooms  square_feet
13405  0.781849   0.758300     0.359520
15599  1.826386  -0.211923    -0.273201
1185  -0.262689   0.758300     0.508098
15417  0.781849   0.758300     0.939682
4915   0.781849   1.728522     0.907338

In [18]:
lm1_scaled=LinearRegression()
lm1_scaled.fit(x_train_scaled,y_train)
lm1_predictions_scaled=lm1.predict(x_train_scaled)
predictions['lm1_scaled']=lm1_predictions_scaled
predictions['lm1_scaled'].head()

0     -5016.782668
1     -5409.995063
2     92583.517843
3   -102798.529942
4     22059.282126
Name: lm1_scaled, dtype: float64

In [19]:
#model 2
lm2_scaled=LinearRegression()
lm2_scaled.fit(x_train_scaled[["square_feet"]],y_train)
lm2_predictions_scaled=lm2.predict(x_train_scaled[["square_feet"]])
predictions['lm2_scaled']=lm2_predictions_scaled

In [20]:
predictions.head()

,actual,lm1,lm2,baseline,lm1_scaled,lm2_scaled
0,475946.0,637253.348706,600593.798130,466158.614463,-5016.782668,-311581.662787
1,250799.0,248217.511284,243878.371844,466158.614463,-5409.995063,-311942.207789
2,199479.0,205250.600682,122011.179945,466158.614463,92583.517843,-312065.383306
3,1252995.0,889736.594052,914571.077257,466158.614463,-102798.529942,-311264.314754
4,107124.0,458628.413111,411022.610732,466158.614463,22059.282126,-311773.269147